devdnl/dnx-rtos/src/system/drivers/eth/stm32h7/eth.c
/*=========================================================================*//**
@file    eth.c

@author  Daniel Zorychta

@brief   This driver support Ethernet interface.

@note    Copyright (C) 2022 Daniel Zorychta <daniel.zorychta@gmail.com>

         This program is free software; you can redistribute it and/or modify
         it under the terms of the GNU General Public License as published by
         the Free Software Foundation and modified by the dnx RTOS exception.

         NOTE: The modification  to the GPL is  included to allow you to
               distribute a combined work that includes dnx RTOS without
               being obliged to provide the source  code for proprietary
               components outside of the dnx RTOS.

         The dnx RTOS  is  distributed  in the hope  that  it will be useful,
         but WITHOUT  ANY  WARRANTY;  without  even  the implied  warranty of
         MERCHANTABILITY  or  FITNESS  FOR  A  PARTICULAR  PURPOSE.  See  the
         GNU General Public License for more details.

         Full license text is available on the following file: doc/license.txt.


*//*==========================================================================*/

/*==============================================================================
  Include files
==============================================================================*/
#include "drivers/driver.h"
#include "eth_ioctl.h"
#include "stm32h7xx_hal_eth.h"
#include "stm32h7xx.h"

/*==============================================================================
  Local macros
==============================================================================*/
#define DEBUG                   0

#define MUTEX_TIMEOUT           10000
#define PHY_BSR_LINK_STATUS     (1 << 2)

#define AHBxENR                  AHB1ENR
#define RCC_AHBxENR_ETHMACRXEN   RCC_AHB1ENR_ETH1RXEN
#define RCC_AHBxENR_ETHMACTXEN   RCC_AHB1ENR_ETH1TXEN
#define RCC_AHBxENR_ETHMACEN     RCC_AHB1ENR_ETH1MACEN
#define CPU_CACHE_ALIGN          32

#if CPU_CACHE_ALIGN != ETH_CPU_CACHE_ALIGN
#error "CPU cache alignments are different!"
#endif

#define DMA_BUFFER_MASK         (CPU_CACHE_ALIGN - 1)
#define DMA_ALIGN_UP(n)         (((n) + DMA_BUFFER_MASK) & ~DMA_BUFFER_MASK)
#define DMA_ALIGN_DOWN(n)       ((n) & ~DMA_BUFFER_MASK)

#define RX_DESC_ARRAY_SIZE      DMA_ALIGN_UP(sizeof(ETH_DMADescTypeDef) * __ETH_RXBUFNB__)
#define TX_DESC_ARRAY_SIZE      DMA_ALIGN_UP(sizeof(ETH_DMADescTypeDef) * __ETH_TXBUFNB__)
#define RX_BUF_ARRAY_SIZE       DMA_ALIGN_UP(ETH_RX_BUF_SIZE_ALIGN * __ETH_RXBUFNB__)
#define TX_BUF_ARRAY_SIZE       DMA_ALIGN_UP(ETH_TX_BUF_SIZE_ALIGN * __ETH_TXBUFNB__)

#define DESCS_BUFFS_SIZE        (RX_DESC_ARRAY_SIZE + TX_DESC_ARRAY_SIZE + RX_BUF_ARRAY_SIZE + TX_BUF_ARRAY_SIZE + CPU_CACHE_ALIGN)

/*==============================================================================
  Local object types
==============================================================================*/
struct eth {
        ksem_t             *rx_semaphore;
        kmtx_t             *mutex;
        ETH_DMADescTypeDef *DMA_rx_desc;
        ETH_DMADescTypeDef *DMA_tx_desc;
        uint8_t            *rx_buff;
        uint8_t            *tx_buff;
        ETH_HandleTypeDef   eth;
        ETH_config_t        config;
        bool                irq_yield;
        bool                configured;
        bool                run;
        u32_t               rx_timeout_ms;
        u32_t               tx_timeout_ms;
        u8_t                descs_and_buffs[DESCS_BUFFS_SIZE];

        struct {
                u32_t rx_packets;
                u32_t tx_packets;
                u64_t rx_bytes;
                u64_t tx_bytes;
                u32_t rx_dropped_frames;
        } stats;
};

/*==============================================================================
  Local function prototypes
==============================================================================*/
static int eth_start(struct eth *hdl);
static int eth_stop(struct eth *hdl);
static int eth_get_info(struct eth *hdl, ETH_status_t *status);
static int eth_flush(struct eth *hdl);
static int packet_receive(struct eth *hdl, ETH_packet_t *pkt);
static int packet_send(struct eth *hdl, const ETH_packet_t *pkt);
static void update_dropped_rx_frames(struct eth *hdl);
static int configure_PHY(struct eth *hdl);

/*==============================================================================
  Local objects
==============================================================================*/
MODULE_NAME(ETH);

static struct eth *eth;

/*==============================================================================
  Exported objects
==============================================================================*/

/*==============================================================================
  External objects
==============================================================================*/

/*==============================================================================
  Function definitions
==============================================================================*/

//==============================================================================
/**
 * @brief Initialize device
 *
 * @param[out]          **device_handle        device allocated memory
 * @param[in ]            major                major device number
 * @param[in ]            minor                minor device number
 * @param[in ]            config               optional module configuration
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_INIT(ETH, void **device_handle, u8_t major, u8_t minor, const void *config)
{
        UNUSED_ARG1(config);

        if (major != 0 || minor != 0) {
                return ENODEV;
        }

        int err = sys_zalloc2(sizeof(struct eth), "SRAM1", _MM_FLAG__DMA_CAPABLE, _MM_FLAG__DMA_CAPABLE, device_handle);
        if (!err) {
                struct eth *hdl = *device_handle;

                hdl->rx_timeout_ms = _MAX_DELAY_MS;
                hdl->tx_timeout_ms = _MAX_DELAY_MS;

                err = sys_semaphore_create(__ETH_RXBUFNB__, 0, &hdl->rx_semaphore);
                if (!err) {

