devdnl/dnx-rtos/src/system/drivers/eth/stm32h7/eth.c
        return err;
}

//==============================================================================
/**
 * @brief  Get Ethernet interface info data.
 *
 * @param  hdl          device handle
 * @param  status       status data
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
static int eth_get_info(struct eth *hdl, ETH_status_t *status)
{
        int err = sys_mutex_lock(hdl->mutex, MUTEX_TIMEOUT);
        if (!err) {

                if (hdl->run) {
                        u32_t reg;

                        if (HAL_ETH_ReadPHYRegister(&hdl->eth, __ETH_PHY_ADDRESS__, PHY_BSR, &reg) == HAL_OK) {

                                if (reg & PHY_BSR_LINK_STATUS) {
                                        status->link_status = ETH_LINK_STATUS__CONNECTED;
                                } else {
                                        status->link_status = ETH_LINK_STATUS__DISCONNECTED;
                                }
                        } else {
                                status->link_status = ETH_LINK_STATUS__PHY_ERROR;
                        }

                        if (HAL_ETH_ReadPHYRegister(&hdl->eth, __ETH_PHY_ADDRESS__, __ETH_PHY_SR__, &reg) == HAL_OK) {

                                if (reg & __ETH_PHY_SPEED_STATUS_BM__) {
                                        status->speed = ETH_SPEED__10Mbps;
                                } else {
                                        status->speed = ETH_SPEED__100Mbps;
                                }

                                if (reg & __ETH_PHY_DUPLEX_STATUS_BM__) {
                                        status->duplex = ETH_DUPLEX__FULL;
                                } else {
                                        status->duplex = ETH_DUPLEX__HALF;
                                }
                        } else {
                                status->link_status = ETH_LINK_STATUS__PHY_ERROR;
                        }
                } else {
                        status->link_status = ETH_LINK_STATUS__PHY_ERROR;
                }

                memcpy(status->MAC, hdl->config.MAC, sizeof(status->MAC));

                status->configured = hdl->configured;
                status->rx_bytes   = hdl->stats.rx_bytes;
                status->tx_bytes   = hdl->stats.tx_bytes;
                status->rx_packets = hdl->stats.rx_packets;
                status->tx_packets = hdl->stats.tx_packets;

                switch (HAL_ETH_GetState(&hdl->eth)) {
                case HAL_ETH_STATE_RESET:
                        status->state = ETH_STATE__RESET;
                        break;
                case HAL_ETH_STATE_READY:
                case HAL_ETH_STATE_BUSY:
                        status->state = ETH_STATE__READY;
                        break;
                case HAL_ETH_STATE_ERROR:
                        status->state = ETH_STATE__ERROR;
                        break;
                }

                update_dropped_rx_frames(hdl);
                status->rx_dropped_frames = hdl->stats.rx_dropped_frames;

                sys_mutex_unlock(hdl->mutex);
        }

        return err;
}

//==============================================================================
/**
 * @brief  Flush Ethernet interface Tx buffers.
 *
 * @param  hdl          device handle
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
static int eth_flush(struct eth *hdl)
{
        int err = sys_mutex_lock(hdl->mutex, MUTEX_TIMEOUT);
        if (!err) {
                int empty_bufs;
                do {
                        empty_bufs = 0;

                        for (int i = 0; i < __ETH_TXBUFNB__; i++) {

                                if (not (hdl->DMA_tx_desc[i].DESC3 & ETH_DMATXNDESCWBF_OWN)) {
                                        empty_bufs++;
                                }
                        }

                        sys_sleep_ms(10);

                } while (empty_bufs < __ETH_TXBUFNB__);

                sys_mutex_unlock(hdl->mutex);
        }

        return err;
}

//==============================================================================
/**
 * @brief  Send packet.
 *
 * @param  hdl          device handle
 * @param  pkt          packet
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
static int packet_send(struct eth *hdl, const ETH_packet_t *pkt)
{
        if (!hdl->run) {
                return EPERM;
        }

        int err = sys_mutex_lock(hdl->mutex, MUTEX_TIMEOUT);
        if (!err) {
                uint8_t *buffer = hdl->tx_buff + (hdl->eth.TxDescList.CurTxDesc * ETH_TX_BUF_SIZE_ALIGN);
                memcpy(buffer, pkt->payload, pkt->length);
                _cpuctl_clean_dcache_by_addr((uint32_t*)buffer, pkt->length);

                ETH_BufferTypeDef tx_buffer;
                tx_buffer.buffer = buffer;
                tx_buffer.len = pkt->length;
                tx_buffer.next = NULL;

                ETH_TxPacketConfig tx_config;
                memset(&tx_config, 0 , sizeof(ETH_TxPacketConfig));
                tx_config.Attributes = ETH_TX_PACKETS_FEATURES_CSUM | ETH_TX_PACKETS_FEATURES_CRCPAD;
                tx_config.ChecksumCtrl = ETH_CHECKSUM_IPHDR_PAYLOAD_INSERT_PHDR_CALC;
                tx_config.CRCPadCtrl = ETH_CRC_PAD_INSERT;
                tx_config.Length = pkt->length;
                tx_config.TxBuffer = &tx_buffer;
                tx_config.pData = NULL;

                err = HAL_ETH_Transmit(&hdl->eth, &tx_config, hdl->tx_timeout_ms);

                /* update statistics */
                update_dropped_rx_frames(hdl);
                hdl->stats.tx_packets++;
                hdl->stats.tx_bytes += pkt->length;

                sys_mutex_unlock(hdl->mutex);
        }

        return err;
}

//==============================================================================
/**
 * @brief  Receive packet.
 *
 * @param  hdl          device handle
 * @param  pkt          packet data
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
static int packet_receive(struct eth *hdl, ETH_packet_t *pkt)
{
        int err = hdl->run ? ESUCC : EPERM;

        clock_t tref = sys_get_uptime_ms();

        while (!err) {
                sys_thread_yield();

                err = sys_mutex_lock(hdl->mutex, MUTEX_TIMEOUT);
                if (!err) {
                        uint32_t *rx_buff;
                        if (HAL_ETH_ReadData(&hdl->eth, cast(void**, &rx_buff)) == 0) {

                                size_t length = *rx_buff;
                                uint8_t *buffer = cast(typeof(buffer), &rx_buff[1]);

