devdnl/dnx-rtos/src/system/drivers/eth/stm32h7/eth.c
                                _cpuctl_invalidate_dcache_by_addr((uint32_t*)buffer, length);
                                memcpy(pkt->payload, buffer, min(pkt->length, length));

                                /* update statistics */
                                update_dropped_rx_frames(hdl);
                                hdl->stats.rx_packets++;
                                hdl->stats.rx_bytes += pkt->length;

                        } else {
                                sys_mutex_unlock(hdl->mutex);

                                if (sys_is_time_expired(tref, hdl->rx_timeout_ms)) {
                                        err = ETIME;
                                        break;
                                }

                                sys_semaphore_wait(hdl->rx_semaphore, 50);
                                continue;
                        }

                        sys_mutex_unlock(hdl->mutex);
                }

                break;
        }

        return err;
}

//==============================================================================
/**
 * @brief  PHY configuration.
 *
 * @param  hdl          driver handle
 *
 * @return On success 0 is returned.
 */
//==============================================================================
static int configure_PHY(struct eth *hdl)
{
        enum ETH_speed  speed  = hdl->config.speed;
        enum ETH_duplex duplex = hdl->config.duplex;
        uint32_t phyreg;

        int err = HAL_ETH_WritePHYRegister(&hdl->eth, __ETH_PHY_ADDRESS__, PHY_BCR, PHY_RESET);
        if (err) goto phy_conf;

        /* Delay to assure PHY reset */
        sys_sleep_ms(PHY_RESET_DELAY);

        if (hdl->config.auto_negotiation) {

                clock_t tref = sys_get_uptime_ms();

                /* We wait for linked status */
                do {
                        sys_sleep_ms(50);

                        HAL_ETH_ReadPHYRegister(&hdl->eth, __ETH_PHY_ADDRESS__, PHY_BSR, &phyreg);

                        if (sys_is_time_expired(tref, 5000)) {
                                err = ETIME;
                                goto phy_conf;
                        }

                } while (((phyreg & PHY_LINKED_STATUS) != PHY_LINKED_STATUS));


                /* Enable Auto-Negotiation */
                err = HAL_ETH_WritePHYRegister(&hdl->eth, __ETH_PHY_ADDRESS__, PHY_BCR, PHY_AUTONEGOTIATION);
                if (err) goto phy_conf;

                /* Get tick */
                tref = sys_get_uptime_ms();

                printk("ETH: auto-negotiation in progress...");

                /* Wait until the auto-negotiation will be completed */
                do {
                        HAL_ETH_ReadPHYRegister(&hdl->eth, __ETH_PHY_ADDRESS__, PHY_BSR, &phyreg);

                        /* Check for the Timeout */
                        if (sys_is_time_expired(tref, 1000)) {
                                printk("ETH: auto-negotiation timeout.");
                                err = ETIME;
                                goto phy_conf;
                        }

                } while (((phyreg & PHY_AUTONEGO_COMPLETE) != PHY_AUTONEGO_COMPLETE));

                /* Read the result of the auto-negotiation */
                err = HAL_ETH_ReadPHYRegister(&hdl->eth, __ETH_PHY_ADDRESS__, PHY_SR, &phyreg);
                if (err) {
                        printk("ETH: auto-negotiation read result error.");
                        goto phy_conf;
                }

                /* Configure the MAC with the Duplex Mode fixed by the auto-negotiation process */
                duplex = (phyreg & PHY_DUPLEX_STATUS) ? ETH_DUPLEX__FULL  : ETH_DUPLEX__HALF;
                speed  = (phyreg & PHY_SPEED_STATUS)  ? ETH_SPEED__10Mbps : ETH_SPEED__100Mbps;

                printk("ETH: auto-negotiated parameters: %d Mbps/%s Duplex.",
                       (speed  == ETH_SPEED__10Mbps) ? 10 : 100,
                       (duplex == ETH_DUPLEX__HALF)  ? "Half" : "Full");

                err = ESUCC;
        }

        phy_conf:
        if (err) {
                err = HAL_ETH_WritePHYRegister(&eth->eth, __ETH_PHY_ADDRESS__, PHY_BCR,
                                               (speed << 13) | (duplex << 8));
                HAL_Delay(PHY_CONFIG_DELAY);
        }

        if (!err) {
                ETH_MACConfigTypeDef MACConf;
                HAL_ETH_GetMACConfig(&hdl->eth, &MACConf);

                MACConf.Speed = (speed == ETH_SPEED__100Mbps) ? ETH_SPEED_100M : ETH_SPEED_10M;
                MACConf.DuplexMode = (duplex == ETH_DUPLEX__FULL) ? ETH_FULLDUPLEX_MODE : ETH_HALFDUPLEX_MODE;

                HAL_ETH_SetMACConfig(&hdl->eth, &MACConf);
        }

        return err;
}

//==============================================================================
/**
 * @brief  Low level Ethernet initialization (library callback).
 *
 * @param  heth         hal ethernet handler
 */
//==============================================================================
void HAL_ETH_MspInit(ETH_HandleTypeDef *heth)
{
        UNUSED_ARG1(heth);

        /* Enable the Ethernet global Interrupt */
        NVIC_SetPriority(ETH_IRQn, _CPU_IRQ_SAFE_PRIORITY_);
        NVIC_EnableIRQ(ETH_IRQn);

        SET_BIT(RCC->AHBxENR, RCC_AHBxENR_ETHMACEN);
        volatile u32_t tmp = READ_BIT(RCC->AHBxENR, RCC_AHBxENR_ETHMACEN);

        SET_BIT(RCC->AHBxENR, RCC_AHBxENR_ETHMACTXEN);
        tmp = READ_BIT(RCC->AHBxENR, RCC_AHBxENR_ETHMACTXEN);

        SET_BIT(RCC->AHBxENR, RCC_AHBxENR_ETHMACRXEN);
        tmp = READ_BIT(RCC->AHBxENR, RCC_AHBxENR_ETHMACRXEN);

        UNUSED_ARG1(tmp);
}

//==============================================================================
/**
 * @brief  Low level Ethernet deinitialization (library callback).
 *
 * @param  heth         hal ethernet handler
 */
//==============================================================================
void HAL_ETH_MspDeInit(ETH_HandleTypeDef *heth)
{
        UNUSED_ARG1(heth);

        NVIC_DisableIRQ(ETH_IRQn);

        CLEAR_BIT(RCC->AHBxENR, RCC_AHBxENR_ETHMACEN);
        volatile u32_t tmp = READ_BIT(RCC->AHBxENR, RCC_AHBxENR_ETHMACEN);

