devdnl/dnx-rtos/src/system/drivers/eth/stm32h7/eth.c
        CLEAR_BIT(RCC->AHBxENR, RCC_AHBxENR_ETHMACTXEN);
        tmp = READ_BIT(RCC->AHBxENR, RCC_AHBxENR_ETHMACTXEN);

        CLEAR_BIT(RCC->AHBxENR, RCC_AHBxENR_ETHMACRXEN);
        tmp = READ_BIT(RCC->AHBxENR, RCC_AHBxENR_ETHMACRXEN);

        UNUSED_ARG1(tmp);
}

//==============================================================================
/**
  * @brief  Ethernet Tx Transfer completed callback
  * @param  heth: ETH handle
  * @retval None
  */
//==============================================================================
void HAL_ETH_TxCpltCallback(ETH_HandleTypeDef *heth)
{
        UNUSED_ARG1(heth);
}

//==============================================================================
/**
 * @brief  Packet receive complete callback (library callback).
 *
 * @param  heth         hal ethernet handler
 */
//==============================================================================
void HAL_ETH_RxCpltCallback(ETH_HandleTypeDef *heth)
{
        UNUSED_ARG1(heth);
        sys_semaphore_signal_from_ISR(eth->rx_semaphore, &eth->irq_yield);
}

//==============================================================================
/**
  * @brief  Ethernet DMA transfer error callback
  * @param  heth: ETH handle
  * @retval None
  */
//==============================================================================
void HAL_ETH_ErrorCallback(ETH_HandleTypeDef *heth)
{
        if ((HAL_ETH_GetDMAError(heth) & ETH_DMACSR_RBU) == ETH_DMACSR_RBU) {
        }
}

//==============================================================================
/**
  * @brief  Ethernet Power Management module IT callback
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval None
  */
//==============================================================================
void HAL_ETH_PMTCallback(ETH_HandleTypeDef *heth)
{
        UNUSED_ARG1(heth);
}

//==============================================================================
/**
  * @brief  Energy Efficient Etherent IT callback
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval None
  */
//==============================================================================
void HAL_ETH_EEECallback(ETH_HandleTypeDef *heth)
{
        UNUSED_ARG1(heth);
}

//==============================================================================
/**
  * @brief  ETH WAKEUP interrupt callback
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval None
  */
//==============================================================================
void HAL_ETH_WakeUpCallback(ETH_HandleTypeDef *heth)
{
        UNUSED_ARG1(heth);
}

//==============================================================================
/**
  * @brief  Rx Allocate callback.
  * @param  buff: pointer to allocated buffer
  * @retval None
  */
//==============================================================================
void HAL_ETH_RxAllocateCallback(uint8_t **buff)
{
        *buff = eth->rx_buff
              + (eth->eth.RxDescList.RxDescIdx * ETH_RX_BUF_SIZE_ALIGN)
              + sizeof(uint32_t); // first 4 bytes used for packet length
}

//==============================================================================
/**
  * @brief  Rx Link callback.
  * @param  pStart: pointer to packet start
  * @param  pStart: pointer to packet end
  * @param  buff: pointer to received data
  * @param  Length: received data length
  * @retval None
  */
//==============================================================================
void HAL_ETH_RxLinkCallback(void **pStart, void **pEnd, uint8_t *buff, uint16_t Length)
{
        UNUSED_ARG1(pEnd);

        uint32_t *rx_buff = cast(void*, (buff - sizeof(uint32_t)));
        *rx_buff = Length;

        *pStart = (void*)rx_buff;
}

//==============================================================================
/**
  * @brief  Tx Free callback.
  * @param  buff: pointer to buffer to free
  * @retval None
  */
//==============================================================================
void HAL_ETH_TxFreeCallback(uint32_t *buff)
{
        UNUSED_ARG1(buff);
}

//==============================================================================
/**
  * @brief  Tx Ptp callback.
  * @param  buff: pointer to application buffer
  * @retval None
  */
//==============================================================================
void HAL_ETH_TxPtpCallback(uint32_t *buff, ETH_TimeStampTypeDef *timestamp)
{
        UNUSED_ARG2(buff, timestamp);
}

//==============================================================================
/**
 * @brief  Read number of dropped frames.
 *
 * @param  hdl          device handle
 */
//==============================================================================
static void update_dropped_rx_frames(struct eth *hdl)
{
        u32_t DMACMFCR = ETH->DMACMFCR;
        u32_t MFC = (DMACMFCR & ETH_DMACMFCR_MFC) >> ETH_DMACMFCR_MFC_Pos;
        hdl->stats.rx_dropped_frames += MFC;
}

//==============================================================================
/**
 * @brief  Ethernet interrupt
 * @param  None
 * @return None
 */
//==============================================================================
void ETH_IRQHandler(void)
{
        HAL_ETH_IRQHandler(&eth->eth);
        sys_thread_yield_from_ISR(eth->irq_yield);
}

/*==============================================================================
  End of file
==============================================================================*/
